In [6]:
import pandas as pd
import random as rand

In [14]:

file_path = "/home/shariya/pandas-practice-task/employees.csv"
data = pd.read_csv(file_path)
print(data.to_string(index=False))

 id          name department  salary
  1    Ian Wright    Support 32357.0
  2 George Miller         IT 38901.0
  3     Bob Smith      Sales     NaN
  4     Bob Smith         IT 57847.0
  5    Nina Lopez  Marketing     NaN
  6    Oscar Reed         IT     NaN
  7 Michael Scott         IT     NaN
  8    Ian Wright         HR 82881.0
  9   Zachary Lee  Marketing     NaN
 10   Zachary Lee    Finance     NaN
 11   Fiona Clark    Support 85611.0
 12  Quincy Baker         IT     NaN
 13 Alice Johnson         IT 37755.0
 14   Zachary Lee Operations     NaN
 15  Rachel Green    Support 35598.0
 16    Sam Wilson Operations 30250.0
 17   Xavier Cole    Support 77614.0
 18   Jane Foster Operations 99592.0
 19 Charlie Brown         IT 80486.0
 20 Michael Scott Operations     NaN
 21    Nina Lopez         HR 66644.0
 22    Nina Lopez         HR 42825.0
 23  Yvonne Blake         IT     NaN
 24  Hannah Davis  Marketing 78212.0
 25   Fiona Clark         IT 43693.0
 26  Hannah Davis      Sales 39569.0
 27  Hannah Davis Operations     NaN
 28 Alice Johnson      Sales 75949.0
 29   Tina Brooks Operations 84352.0
 30    Nina Lopez  Marketing     NaN
 31    Nina Lopez    Support     NaN
 32  Rachel Green         HR     NaN
 33  Victor Stone Operations     NaN
 34   Xavier Cole Operations     NaN
 35    Uma Carter  Marketing 81024.0
 36  Diana Prince         IT 44180.0
 37    Uma Carter         HR 70409.0
 38    Nina Lopez    Support     NaN
 39  Yvonne Blake    Support     NaN
 40  Victor Stone         IT     NaN
 41 Charlie Brown Operations 83505.0
 42   Fiona Clark         HR     NaN
 43   Zachary Lee         IT 64756.0
 44    Ian Wright    Finance 41071.0
 45    Oscar Reed    Finance     NaN
 46 Alice Johnson Operations     NaN
 47  Rachel Green    Finance 92591.0
 48  Quincy Baker Operations     NaN
 49    Sam Wilson         HR 63371.0
 50   Zachary Lee         HR 99914.0
 51  Yvonne Blake    Finance 39772.0
 52    Sam Wilson    Finance     NaN
 53    Sam Wilson         HR 94694.0
 54    Ian Wright    Support     NaN
 55  Diana Prince    Finance     NaN
 56   Xavier Cole Operations 32434.0
 57    Sam Wilson      Sales     NaN
 58     Bob Smith    Finance     NaN
 59  Rachel Green    Finance 87570.0
 60    Laura Hill         HR 35401.0
 61   Paula Adams  Marketing     NaN
 62 Charlie Brown  Marketing 42226.0
 63    Sam Wilson Operations 62030.0
 64   Zachary Lee    Finance     NaN
 65    Ethan Hunt    Support 43845.0
 66 George Miller  Marketing 77075.0
 67  Quincy Baker    Support 84816.0
 68  Kevin Turner         IT 36312.0
 69 George Miller    Finance     NaN
 70    Laura Hill    Finance     NaN
 71    Ethan Hunt         HR 61659.0
 72 Charlie Brown      Sales     NaN
 73   Wendy Hayes         HR     NaN
 74   Zachary Lee         IT     NaN
 75    Ethan Hunt    Finance     NaN
 76  Kevin Turner      Sales     NaN
 77    Nina Lopez      Sales 69652.0
 78  Hannah Davis         HR     NaN
 79    Oscar Reed    Support 80933.0
 80  Victor Stone  Marketing     NaN
 81   Paula Adams    Support     NaN
 82 Michael Scott         HR 98128.0
 83   Xavier Cole    Support     NaN
 84  Rachel Green    Support 81322.0
 85    Ethan Hunt  Marketing     NaN
 86  Kevin Turner  Marketing 78453.0
 87  Hannah Davis  Marketing 73653.0
 88    Nina Lopez         HR     NaN
 89    Nina Lopez  Marketing     NaN
 90   Xavier Cole         HR     NaN
 91    Sam Wilson         IT 33789.0
 92   Fiona Clark      Sales 87942.0
 93  Diana Prince    Support     NaN
 94  Diana Prince         HR     NaN
 95    Laura Hill  Marketing 40730.0
 96   Tina Brooks      Sales 95113.0
 97  Kevin Turner         IT     NaN
 98    Nina Lopez    Finance     NaN
 99    Ethan Hunt    Support     NaN
100    Laura Hill    Finance 83937.0

find avarage salery

In [19]:
data["salary"] = data["salary"].fillna(data["salary"].mean())

print(data)

     id           name department    salary
0     1     Ian Wright    Support  32357.00
1     2  George Miller         IT  38901.00
2     3      Bob Smith      Sales  65048.86
3     4      Bob Smith         IT  57847.00
4     5     Nina Lopez  Marketing  65048.86
..  ...            ...        ...       ...
95   96    Tina Brooks      Sales  95113.00
96   97   Kevin Turner         IT  65048.86
97   98     Nina Lopez    Finance  65048.86
98   99     Ethan Hunt    Support  65048.86
99  100     Laura Hill    Finance  83937.00

[100 rows x 4 columns]

     id           name department    salary
0     1     Ian Wright    Support  32357.00
1     2  George Miller         IT  38901.00
2     3      Bob Smith      Sales  65048.86
3     4      Bob Smith         IT  57847.00
4     5     Nina Lopez  Marketing  65048.86
..  ...            ...        ...       ...
95   96    Tina Brooks      Sales  95113.00
96   97   Kevin Turner         IT  65048.86
97   98     Nina Lopez    Finance  65048.86
98   99     Ethan Hunt    Support  65048.86
99  100     Laura Hill    Finance  83937.00

[100 rows x 4 columns]

/tmp/ipykernel_4563/722604213.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data["salary"].fillna(data["salary"].mean(), inplace=True)

In [20]:
highiest_paid_employee = data['salary'].max();
print(highiest_paid_employee)

99914.0

In [22]:
group_by_department = data.groupby("department")["salary"].mean()
print(group_by_department)

department
Finance       66361.973333
HR            68898.118824
IT            55816.313750
Marketing     66193.930000
Operations    65192.693846
Sales         69824.493333
Support       65155.430000
Name: salary, dtype: float64

In [24]:
import seaborn as sns
import pandas as pd

data = sns.load_dataset("titanic")

print(data.head())

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True

In [29]:
# print((data["survived"] == 1).count())
data[data["survived"] == 1].count()

survived       342
pclass         342
sex            342
age            290
sibsp          342
parch          342
fare           342
embarked       340
class          342
who            342
adult_male     342
deck           136
embark_town    340
alive          342
alone          342
dtype: int64

In [2]:
names = [
    "Alice", "Bob", "Charlie", "Diana", "Ethan",
    "Fiona", "George", "Hannah", "Ian", "Julia",
    "Kevin", "Laura", "Michael", "Nina", "Oscar",
    "Paula", "Quentin", "Rachel", "Steve", "Tina"
]
ages = [
    15, 16, 15, 17, 16,
    15, 17, 16, 15, 17,
    16, 15, 17, 16, 15,
    17, 16, 15, 17, 16
]

marks = [
    78, 85, 92, 74, 88,
    95, 67, 80, 90, 73,
    82, 96, 68, 87, 91,
    77, 84, 93, 70, 89
]


students = {
    "name" : names,
    "age" : ages,
    "marks": marks

}
print(students)

{'name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Ethan', 'Fiona', 'George', 'Hannah', 'Ian', 'Julia', 'Kevin', 'Laura', 'Michael', 'Nina', 'Oscar', 'Paula', 'Quentin', 'Rachel', 'Steve', 'Tina'], 'age': [15, 16, 15, 17, 16, 15, 17, 16, 15, 17, 16, 15, 17, 16, 15, 17, 16, 15, 17, 16], 'marks': [78, 85, 92, 74, 88, 95, 67, 80, 90, 73, 82, 96, 68, 87, 91, 77, 84, 93, 70, 89]}

In [ ]:
Find average marks per student.

In [11]:
data = pd.DataFrame(students);
print(data)

       name  age  marks
0     Alice   15     78
1       Bob   16     85
2   Charlie   15     92
3     Diana   17     74
4     Ethan   16     88
5     Fiona   15     95
6    George   17     67
7    Hannah   16     80
8       Ian   15     90
9     Julia   17     73
10    Kevin   16     82
11    Laura   15     96
12  Michael   17     68
13     Nina   16     87
14    Oscar   15     91
15    Paula   17     77
16  Quentin   16     84
17   Rachel   15     93
18    Steve   17     70
19     Tina   16     89

In [12]:
avarage_marks_per_student = data["marks"].mean()
print(avarage_marks_per_student)

82.95

In [14]:
highest_total_marks_student = data["marks"].max()
print(highest_total_marks_student)

96